{"class_name": "Tokenizer", "config": {"num_words": 10000, "filters": "!\"#$%&()*+,-./:;<=>?@[\\]^_`{|}~\t\n", "lower": true, "split": " ", "char_level": false, "oov_token": "<OOV>", "document_count": 1573, "word_counts": "{\"we\": 54, \"'ve\": 1, \"been\": 66, \"feeling\": 1, \"quite\": 6, \"positive\": 19, \"about\": 41, \"the\": 1853, \"region\": 12, \"as\": 141, \"a\": 626, \"whole\": 8, \"wartsila\": 4, \"won\": 29, \"contract\": 54, \"in\": 1161, \"october\": 25, \"2007\": 115, \"and\": 704, \"plant\": 32, \"will\": 201, \"be\": 105, \"installed\": 3, \"at\": 151, \"manturovo\": 1, \"kostroma\": 1, \"of\": 1028, \"russia\": 32, \"600\": 2, \"km\": 1, \"northeast\": 1, \"moscow\": 3, \"proportion\": 1, \"estonian\": 5, \"lithuanian\": 6, \"passengers\": 8, \"on\": 230, \"tallinn\": 9, \"helsinki\": 57, \"route\": 7, \"also\": 69, \"grew\": 25, \"july\": 18, \"finnish\": 258, \"automation\": 9, \"solutions\": 45, \"developer\": 20, \"cencorp\": 5, \"corporation\": 40, \"omx\": 42, \"cnc1v\": 2, \"said\": 258, \"friday\": 10, \"27\": 11, \"june\": 29, \"that\": 156, \"it\": 178, \"has\": 218, \"completed\": 9, \"employee\": 3, \"negotiations\": 17, \"regarding\": 2, \"reorganisation\": 3, \"its\": 283, \"operations\": 50, \"tallink\": 3, \"claims\": 2, \"watertight\": 1, \"doors\": 1, \"both\": 32, \"vana\": 1, \"regina\": 1, \"baltica\": 1, \"including\": 14, \"their\": 25, \"electrical\": 3, \"systems\": 30, \"are\": 79, \"fully\": 6, \"working\": 10, \"order\": 42, \"service\": 33, \"is\": 163, \"intended\": 2, \"to\": 1041, \"allow\": 3, \"people\": 16, \"thirteen\": 1, \"mediterranean\": 2, \"countries\": 16, \"reach\": 7, \"baltic\": 13, \"more\": 45, \"rapidly\": 3, \"with\": 190, \"single\": 3, \"carrier\": 8, \"energy\": 11, \"company\": 275, \"fortum\": 4, \"oyj\": 122, \"november\": 19, \"13\": 24, \"was\": 141, \"granted\": 2, \"an\": 110, \"environmental\": 2, \"permit\": 1, \"build\": 2, \"biofuel\": 1, \"fired\": 1, \"combined\": 7, \"heat\": 1, \"power\": 7, \"chp\": 1, \"vartan\": 1, \"harbor\": 2, \"eastern\": 7, \"stockholm\": 6, \"operating\": 179, \"profit\": 282, \"eur\": 604, \"11\": 35, \"07\": 2, \"mn\": 353, \"up\": 94, \"from\": 445, \"8\": 131, \"65\": 9, \"growth\": 41, \"strongest\": 2, \"f\": 6, \"secure\": 6, \"'s\": 340, \"operator\": 8, \"isps\": 1, \"mobile\": 39, \"operators\": 9, \"cable\": 3, \"business\": 50, \"jp\": 1, \"morgan\": 2, \"expects\": 18, \"scala\": 1, \"lower\": 24, \"nobel\": 1, \"biocare\": 1, \"forecast\": 6, \"for\": 424, \"current\": 16, \"guidance\": 2, \"23\": 23, \"25\": 24, \"pct\": 46, \"well\": 22, \"margin\": 16, \"target\": 16, \"34\": 7, \"35\": 14, \"qualcomm\": 4, \"estimated\": 22, \"first\": 106, \"quarter\": 161, \"between\": 20, \"46\": 7, \"50\": 21, \"cents\": 2, \"share\": 83, \"excluding\": 14, \"certain\": 3, \"items\": 17, \"below\": 7, \"analyst\": 6, \"estimate\": 5, \"61\": 4, \"stx\": 1, \"finland\": 104, \"oy\": 18, \"signed\": 47, \"preliminary\": 4, \"agreement\": 43, \"building\": 11, \"environmentally\": 3, \"friendly\": 2, \"new\": 72, \"generation\": 5, \"cruise\": 3, \"ferry\": 3, \"viking\": 6, \"line\": 26, \"manage\": 1, \"turku\": 3, \"sweden\": 13, \"withviking\": 1, \"abp\": 7, \"neste\": 9, \"oil\": 16, \"awarded\": 26, \"chemical\": 2, \"industry\": 27, \"federation\": 2, \"innovation\": 1, \"award\": 2, \"nexbtl\": 2, \"technology\": 52, \"which\": 68, \"enables\": 4, \"biodiesel\": 3, \"produced\": 4, \"vegetable\": 2, \"animal\": 3, \"fat\": 3, \"one\": 29, \"challenges\": 1, \"production\": 40, \"north\": 17, \"sea\": 4, \"scale\": 3, \"formation\": 1, \"can\": 19, \"plug\": 1, \"pipelines\": 1, \"halt\": 1, \"this\": 56, \"significant\": 22, \"milestone\": 3, \"benefon\": 6, \"helping\": 2, \"us\": 32, \"critical\": 1, \"usp\": 1, \"our\": 57, \"personal\": 2, \"navigation\": 5, \"product\": 14, \"roadmap\": 1, \"beyond\": 2, \"''\": 97, \"commented\": 2, \"simon\": 1, \"button\": 1, \"chief\": 13, \"officer\": 4, \"second\": 48, \"2010\": 122, \"group\": 109, \"net\": 237, \"rose\": 78, \"eur3\": 8, \"1\": 242, \"m\": 193, \"eur2\": 13, \"5\": 192, \"april\": 18, \"2009\": 154, \"electronics\": 16, \"manufacturing\": 16, \"services\": 61, \"elcoteq\": 18, \"signing\": 1, \"cooperation\": 18, \"japanese\": 4, \"phone\": 15, \"manufacturer\": 22, \"bypasses\": 1, \"says\": 17, \"jan\": 7, \"kotka\": 1, \"ceo\": 22, \"insurance\": 16, \"fennia\": 1, \"kesko\": 13, \"ending\": 2, \"loyal\": 2, \"customer\": 8, \"kaido\": 1, \"kaare\": 1, \"general\": 8, \"director\": 17, \"atria\": 12, \"eesti\": 2, \"investments\": 11, \"upgrade\": 6, \"pig\": 1, \"farms\": 1, \"surpass\": 2, \"eek\": 3, \"150mn\": 1, \"9\": 123, \"59\": 6, \"usd\": 40, \"14\": 30, \"19\": 23, \"past\": 4, \"years\": 16, \"3\": 187, \"compared\": 112, \"year\": 260, \"earlier\": 58, \"construction\": 26, \"lemminkainen\": 4, \"hel\": 66, \"lem1s\": 2, \"today\": 83, \"provide\": 8, \"technical\": 5, \"nevsky\": 2, \"centre\": 3, \"shopping\": 6, \"mall\": 2, \"opened\": 6, \"st\": 11, \"petersburg\": 11, \"bilfinger\": 1, \"investors\": 3, \"cheered\": 1, \"pushing\": 1, \"shares\": 28, \"7\": 125, \"or\": 21, \"euro\": 86, \"30\": 35, \"29\": 14, \"afternoon\": 4, \"trade\": 13, \"sales\": 232, \"nine\": 33, \"month\": 32, \"period\": 182, \"increased\": 83, \"respectively\": 21, \"by\": 244, \"26\": 18, \"6\": 135, \"4\": 153, \"corresponding\": 82, \"2006\": 81, \"according\": 36, \"updated\": 1, \"strategy\": 12, \"2012\": 1, \"basware\": 16, \"targets\": 4, \"long\": 28, \"term\": 23, \"range\": 3, \"20\": 34, \"40\": 24, \"10\": 47, \"broker\": 4, \"initiated\": 4, \"palfinger\": 1, \"ag\": 4, \"konecranes\": 10, \"buy\": 11, \"'\": 53, \"recommendations\": 1, \"51\": 8, \"42\": 13, \"price\": 21, \"fell\": 41, \"15\": 39, \"24\": 17, \"korhonen\": 1, \"dismissed\": 4, \"her\": 1, \"post\": 3, \"editor\": 1, \"newspaper\": 2, \"lapin\": 1, \"kansa\": 1, \"december\": 18, \"2008\": 142, \"now\": 25, \"intensifying\": 1, \"smelter\": 1, \"increasing\": 4, \"annual\": 18, \"capacity\": 20, \"230\": 1, \"000\": 73, \"tonnes\": 7, \"copper\": 2, \"realignment\": 1, \"interests\": 1, \"sector\": 16, \"clearly\": 5, \"under\": 9, \"way\": 7, \"supplier\": 20, \"efore\": 7, \"plc\": 18, \"streamline\": 3, \"electronic\": 6, \"efo1v\": 2, \"tuesday\": 12, \"february\": 17, \"statutory\": 1, \"streamlining\": 3, \"insurer\": 3, \"anticipates\": 4, \"nordea\": 10, \"unit\": 19, \"costs\": 19, \"flight\": 2, \"percent\": 67, \"kci\": 3, \"four\": 9, \"hot\": 2, \"metal\": 15, \"ladle\": 1, \"cranes\": 5, \"indian\": 4, \"steel\": 26, \"producer\": 6, \"bhushan\": 1, \"strips\": 1, \"delivered\": 5, \"kaupthing\": 5, \"forecasts\": 5, \"increase\": 59, \"printing\": 10, \"paper\": 33, \"only\": 7, \"driver\": 1, \"left\": 2, \"car\": 4, \"suspect\": 2, \"who\": 2, \"kidnapped\": 1, \"forced\": 3, \"gunpoint\": 1, \"drive\": 1, \"durham\": 1, \"stock\": 24, \"third\": 54, \"day\": 10, \"bringing\": 2, \"three\": 24, \"rise\": 9, \"gbx10\": 1, \"svyturys\": 1, \"utenos\": 1, \"alus\": 2, \"controlled\": 5, \"nordic\": 14, \"beverages\": 1, \"holding\": 5, \"bbh\": 1, \"posted\": 13, \"per\": 64, \"cent\": 16, \"beer\": 12, \"january\": 32, \"may\": 21, \"22\": 20, \"million\": 189, \"litres\": 4, \"acquisition\": 17, \"sampo\": 6, \"bank\": 42, \"makes\": 6, \"strategic\": 11, \"sense\": 2, \"db\": 1, \"lindsey\": 1, \"liddell\": 1, \"fitch\": 2, \"ratings\": 2, \"financial\": 35, \"institutions\": 2, \"0\": 148, \"2004\": 26, \"customers\": 33, \"have\": 75, \"chance\": 2, \"make\": 11, \"bookings\": 1, \"all\": 24, \"they\": 11, \"want\": 1, \"location\": 6, \"mikko\": 2, \"tuomainen\": 1, \"charge\": 1, \"finnair\": 19, \"internet\": 7, \"rate\": 6, \"paying\": 1, \"off\": 28, \"national\": 7, \"debt\": 3, \"extremely\": 6, \"painful\": 1, \"improved\": 19, \"16\": 28, \"london\": 8, \"afx\": 9, \"rautaruukki\": 12, \"corp\": 14, \"upgraded\": 4, \"hold\": 4, \"sell\": 7, \"abn\": 1, \"amro\": 1, \"raised\": 8, \"75\": 4, \"dealers\": 5, \"sto\": 4, \"nda\": 1, \"helped\": 2, \"real\": 14, \"estate\": 4, \"investment\": 21, \"sponda\": 6, \"sda1v\": 2, \"place\": 7, \"eur100m\": 1, \"usd125\": 1, \"domestic\": 7, \"bond\": 1, \"aker\": 6, \"yards\": 5, \"ferries\": 4, \"division\": 14, \"went\": 16, \"down\": 63, \"non\": 21, \"recurring\": 16, \"decreased\": 53, \"2\": 194, \"representing\": 8, \"significance\": 1, \"teleste\": 12, \"emphasised\": 1, \"large\": 10, \"size\": 3, \"growing\": 6, \"economy\": 4, \"rapid\": 3, \"development\": 13, \"tv\": 2, \"distribution\": 8, \"poland\": 4, \"viewed\": 1, \"attractive\": 2, \"market\": 76, \"transactions\": 2, \"would\": 27, \"earnings\": 36, \"some\": 26, \"eur0\": 41, \"28\": 15, \"however\": 24, \"shrank\": 2, \"47\": 6, \"48\": 10, \"cerberus\": 1, \"capital\": 22, \"management\": 24, \"lp\": 1, \"backed\": 1, \"maker\": 45, \"newpage\": 1, \"mixed\": 2, \"results\": 9, \"casting\": 1, \"cloud\": 4, \"over\": 26, \"planned\": 5, \"initial\": 2, \"public\": 4, \"offering\": 10, \"raute\": 10, \"rutav\": 3, \"issued\": 9, \"september\": 36, \"warning\": 9, \"clothing\": 10, \"developed\": 3, \"best\": 11, \"pharmaceuticals\": 2, \"orion\": 7, \"reported\": 22, \"fall\": 11, \"were\": 30, \"hit\": 7, \"larger\": 3, \"expenditures\": 1, \"r\": 7, \"d\": 7, \"marketing\": 4, \"matti\": 3, \"karppinen\": 1, \"frozen\": 2, \"foods\": 2, \"good\": 16, \"result\": 43, \"did\": 2, \"12\": 38, \"eur5\": 10, \"while\": 30, \"eur62\": 1, \"vaahto\": 11, \"provides\": 7, \"making\": 10, \"process\": 12, \"machinery\": 20, \"starting\": 8, \"concerning\": 6, \"temporary\": 11, \"lay\": 19, \"offs\": 10, \"140\": 4, \"employees\": 20, \"plants\": 7, \"hollola\": 2, \"tampere\": 3, \"reporting\": 5, \"43\": 10, \"snow\": 2, \"storms\": 2, \"brought\": 3, \"trees\": 2, \"lines\": 7, \"cutting\": 6, \"electricity\": 1, \"households\": 1, \"omxn40\": 3, \"index\": 13, \"comprising\": 3, \"most\": 19, \"traded\": 3, \"stocks\": 6, \"nasdaq\": 5, \"exchange\": 15, \"closed\": 7, \"084\": 1, \"points\": 13, \"offer\": 8, \"represents\": 3, \"premium\": 1, \"closing\": 2, \"ruukki\": 22, \"romania\": 4, \"local\": 14, \"arm\": 1, \"900\": 5, \"mln\": 163, \"through\": 15, \"cash\": 22, \"contribution\": 1, \"flow\": 16, \"recent\": 6, \"reached\": 6, \"eight\": 3, \"low\": 7, \"several\": 11, \"tacked\": 1, \"original\": 2, \"name\": 2, \"componenta\": 12, \"l\": 9, \"subsidiary\": 14, \"changed\": 2, \"components\": 8, \"seen\": 10, \"63\": 5, \"q1\": 9, \"comparison\": 1, \"glaston\": 8, \"headquartered\": 1, \"international\": 15, \"glass\": 6, \"launch\": 7, \"3g\": 8, \"handsets\": 3, \"nokia\": 40, \"aims\": 10, \"become\": 7, \"winner\": 1, \"china\": 17, \"2g\": 2, \"markets\": 16, \"had\": 24, \"expecting\": 1, \"poor\": 2, \"performance\": 15, \"x20ac\": 12, \"89\": 4, \"33\": 16, \"84\": 4, \"early\": 4, \"trading\": 5, \"solid\": 2, \"credit\": 8, \"dz\": 1, \"rabobank\": 1, \"thesis\": 3, \"contest\": 1, \"aimed\": 5, \"enhance\": 3, \"quality\": 7, \"strengthen\": 10, \"culture\": 1, \"polytechnics\": 1, \"producing\": 4, \"advanced\": 3, \"fuel\": 8, \"couple\": 2, \"weeks\": 6, \"august\": 14, \"measuring\": 1, \"equipment\": 28, \"vaisala\": 5, \"vaias\": 2, \"loss\": 120, \"widened\": 4, \"eur4\": 9, \"half\": 39, \"talvivaara\": 8, \"maintains\": 1, \"assumption\": 1, \"turning\": 2, \"before\": 25, \"end\": 31, \"returned\": 3, \"pekka\": 4, \"eloholma\": 1, \"juha\": 5, \"jordan\": 2, \"engineer\": 2, \"reasons\": 1, \"choosing\": 1, \"vacon\": 6, \"global\": 17, \"ac\": 3, \"drives\": 3, \"support\": 11, \"centres\": 1, \"same\": 47, \"where\": 10, \"operates\": 2, \"messaging\": 3, \"tecnomen\": 4, \"tem1v\": 1, \"thursday\": 13, \"received\": 14, \"expansion\": 10, \"convergent\": 2, \"charging\": 3, \"solution\": 19, \"latin\": 5, \"america\": 15, \"objective\": 2, \"existing\": 7, \"adp\": 23, \"news\": 30, \"feb\": 11, \"wood\": 8, \"products\": 42, \"op\": 2, \"pohjola\": 6, \"staff\": 18, \"union\": 8, \"boycotting\": 1, \"tasks\": 1, \"because\": 9, \"refused\": 1, \"take\": 7, \"sale\": 12, \"into\": 23, \"account\": 1, \"determining\": 1, \"wages\": 1, \"2005\": 62, \"saw\": 6, \"eur1\": 19, \"danish\": 3, \"danske\": 4, \"reports\": 19, \"taxes\": 11, \"152\": 3, \"32\": 11, \"totalled\": 34, \"layoffs\": 7, \"suomussalmi\": 1, \"kuhmo\": 1, \"autumn\": 6, \"codetermination\": 1, \"held\": 6, \"there\": 7, \"revenue\": 17, \"slightly\": 8, \"495\": 1, \"634\": 1, \"497\": 1, \"transaction\": 10, \"aspo\": 9, \"expand\": 15, \"manages\": 1, \"slipped\": 7, \"dragged\": 2, \"enterprise\": 6, \"grapevine\": 1, \"city\": 10, \"officials\": 2, \"approved\": 5, \"tax\": 12, \"rebates\": 1, \"grants\": 1, \"recruited\": 1, \"japan\": 6, \"further\": 18, \"complement\": 1, \"network\": 19, \"close\": 8, \"locations\": 5, \"than\": 55, \"worldwide\": 3, \"agreed\": 10, \"poultry\": 2, \"s\": 20, \"eur23\": 2, \"combination\": 2, \"yit\": 15, \"quarters\": 1, \"totaled\": 22, \"106\": 1, \"euros\": 25, \"drop\": 7, \"pleased\": 7, \"efforts\": 1, \"negotiating\": 2, \"teams\": 1, \"look\": 4, \"forward\": 6, \"productive\": 1, \"ahead\": 3, \"18\": 27, \"interest\": 12, \"income\": 17, \"oct\": 3, \"consulting\": 3, \"engineering\": 18, \"poyry\": 6, \"poy1v\": 1, \"extension\": 3, \"consultancy\": 2, \"venezuel\": 1, \"gain\": 7, \"recognized\": 4, \"incap\": 6, \"provider\": 23, \"affecto\": 4, \"frame\": 3, \"valued\": 1, \"eur2m\": 3, \"implement\": 4, \"next\": 13, \"phase\": 2, \"application\": 3, \"south\": 10, \"african\": 2, \"mutual\": 1, \"federal\": 3, \"limited\": 3, \"food\": 16, \"ltd\": 20, \"press\": 11, \"release\": 20, \"04\": 6, \"01\": 5, \"00\": 6, \"launching\": 1, \"major\": 9, \"campaign\": 1, \"recruit\": 2, \"many\": 4, \"hundred\": 1, \"k\": 3, \"retailers\": 1, \"silicon\": 6, \"wafer\": 2, \"okmetic\": 8, \"okm1v\": 3, \"ramirent\": 9, \"made\": 5, \"kroons\": 3, \"last\": 45, \"black\": 1, \"announced\": 20, \"restructuring\": 9, \"significantly\": 9, \"decrease\": 10, \"indebtedness\": 1, \"continue\": 11, \"invest\": 5, \"future\": 7, \"qt\": 1, \"benefit\": 1, \"users\": 4, \"commercial\": 7, \"lgpl\": 1, \"253\": 2, \"252\": 1, \"recorded\": 7, \"calling\": 1, \"innovators\": 1, \"africa\": 8, \"competition\": 6, \"specifically\": 1, \"launched\": 2, \"enable\": 9, \"developers\": 2, \"create\": 4, \"locally\": 1, \"relevant\": 2, \"breed\": 1, \"applications\": 4, \"fourth\": 19, \"rapala\": 13, \"swing\": 2, \"back\": 8, \"pretax\": 19, \"uplift\": 1, \"44\": 8, \"stronger\": 5, \"proven\": 1, \"track\": 4, \"record\": 9, \"ems\": 3, \"factory\": 7, \"coupled\": 1, \"modern\": 2, \"consistent\": 1, \"processes\": 4, \"recovery\": 3, \"demand\": 22, \"started\": 5, \"toward\": 1, \"continued\": 10, \"march\": 15, \"turned\": 8, \"eps\": 34, \"03\": 5, \"versus\": 18, \"agro\": 1, \"lietuva\": 1, \"agricultural\": 2, \"grain\": 3, \"trader\": 1, \"another\": 5, \"member\": 1, \"boosted\": 4, \"vat\": 3, \"inclusive\": 2, \"bofa\": 1, \"downgraded\": 1, \"swedish\": 23, \"stora\": 18, \"enso\": 17, \"sterv\": 1, \"player\": 4, \"upm\": 16, \"kymmene\": 10, \"upm1v\": 1, \"underperf\": 1, \"total\": 30, \"funds\": 2, \"managed\": 3, \"284mn\": 1, \"kone\": 11, \"months\": 34, \"higher\": 19, \"led\": 1, \"after\": 29, \"plans\": 16, \"team\": 6, \"sanyo\": 1, \"manufacture\": 2, \"nokian\": 8, \"tyres\": 5, \"report\": 16, \"beat\": 1, \"analysts\": 4, \"expectations\": 4, \"government\": 4, \"wednesday\": 10, \"sold\": 8, \"stake\": 6, \"chemicals\": 3, \"fertilizer\": 2, \"kemira\": 9, \"655\": 1, \"890us\": 1, \"sending\": 2, \"initially\": 2, \"cut\": 18, \"jobs\": 12, \"experience\": 11, \"smartphone\": 4, \"functionality\": 3, \"uniting\": 1, \"two\": 25, \"smooth\": 1, \"user\": 7, \"voice\": 6, \"capabilities\": 4, \"streamlined\": 1, \"comply\": 1, \"recalls\": 1, \"other\": 23, \"traceability\": 1, \"requirements\": 4, \"providing\": 9, \"them\": 4, \"competitive\": 4, \"advantage\": 3, \"fair\": 8, \"value\": 15, \"change\": 3, \"properties\": 7, \"eu\": 5, \"commission\": 4, \"fined\": 2, \"thyssenkrupp\": 1, \"united\": 3, \"technologies\": 5, \"otis\": 1, \"schindler\": 1, \"992\": 1, \"alleged\": 1, \"cartel\": 2, \"activity\": 1, \"lift\": 2, \"going\": 4, \"twelve\": 1, \"purchase\": 7, \"financing\": 7, \"provided\": 3, \"latvia\": 4, \"broadband\": 9, \"infrastructure\": 5, \"develop\": 6, \"areas\": 8, \"acquisitions\": 3, \"companies\": 39, \"declined\": 10, \"mainly\": 4, \"due\": 22, \"cost\": 21, \"recycled\": 3, \"fiber\": 2, \"strengthened\": 4, \"marketwatch\": 2, \"nok\": 2, \"five\": 7, \"run\": 4, \"hutchison\": 1, \"essar\": 1, \"india\": 8, \"software\": 24, \"ixonos\": 6, \"xns1v\": 1, \"laying\": 3, \"temporarily\": 11, \"pori\": 2, \"mill\": 9, \"christmas\": 1, \"till\": 1, \"decided\": 6, \"shut\": 1, \"ammonia\": 1, \"billingham\": 1, \"extend\": 2, \"maintenance\": 7, \"ince\": 1, \"facility\": 13, \"instead\": 2, \"binding\": 1, \"letter\": 1, \"intent\": 1, \"asian\": 4, \"investor\": 6, \"769\": 1, \"bn\": 7, \"878\": 1, \"rationalization\": 1, \"seeks\": 1, \"achieve\": 4, \"yearly\": 2, \"savings\": 16, \"industrial\": 14, \"wat1s\": 1, \"announcement\": 4, \"totaling\": 2, \"125\": 2, \"60\": 7, \"registered\": 3, \"petrol\": 1, \"station\": 5, \"chain\": 9, \"st1\": 1, \"managing\": 8, \"kim\": 2, \"wiio\": 1, \"purchases\": 2, \"rising\": 3, \"prices\": 18, \"consumer\": 5, \"almost\": 6, \"daily\": 5, \"dropped\": 14, \"55\": 7, \"77\": 3, \"rates\": 8, \"base\": 10, \"metals\": 4, \"complying\": 1, \"european\": 6, \"water\": 6, \"framework\": 4, \"directive\": 1, \"pre\": 9, \"treatment\": 2, \"renovated\": 1, \"hydraulics\": 2, \"waste\": 4, \"inception\": 1, \"degridding\": 1, \"sand\": 1, \"grease\": 1, \"removal\": 1, \"deodorization\": 1, \"norway\": 4, \"supply\": 31, \"suction\": 1, \"anchors\": 1, \"kalajoki\": 1, \"technopolis\": 2, \"memorandum\": 2, \"set\": 3, \"techno\": 1, \"park\": 3, \"neudorf\": 1, \"zone\": 1, \"village\": 1, \"strelny\": 1, \"suburbs\": 1, \"profitability\": 9, \"ebit\": 9, \"previous\": 18, \"superior\": 2, \"centricity\": 1, \"expertise\": 6, \"digital\": 6, \"apart\": 2, \"competitors\": 4, \"department\": 7, \"store\": 11, \"beginning\": 5, \"secured\": 3, \"deliver\": 15, \"gas\": 4, \"fuelled\": 2, \"main\": 8, \"engines\": 3, \"propulsion\": 1, \"vessel\": 5, \"computer\": 2, \"proha\": 2, \"art1v\": 1, \"narrowed\": 15, \"113\": 3, \"146\": 1, \"these\": 9, \"aggregate\": 1, \"holdings\": 5, \"burrill\": 1, \"life\": 7, \"sciences\": 1, \"fund\": 5, \"p\": 8, \"number\": 22, \"votes\": 3, \"being\": 10, \"hormone\": 1, \"treatments\": 1, \"established\": 6, \"17\": 22, \"feet\": 1, \"foot\": 2, \"mount\": 1, \"everest\": 1, \"mountain\": 1, \"climbers\": 1, \"035\": 1, \"summit\": 2, \"surf\": 1, \"even\": 5, \"send\": 2, \"videos\": 1, \"exploits\": 2, \"time\": 18, \"opening\": 5, \"stockmann\": 6, \"hack\": 1, \"extra\": 2, \"nefarious\": 1, \"tweets\": 1, \"activated\": 1, \"without\": 3, \"clicked\": 1, \"enough\": 1, \"web\": 4, \"surfers\": 1, \"move\": 10, \"mouse\": 2, \"cursors\": 1, \"packaging\": 13, \"huhtamaki\": 3, \"axe\": 1, \"90\": 5, \"hampshire\": 1, \"aktia\": 8, \"reference\": 1, \"grade\": 1, \"instruments\": 3, \"challenging\": 2, \"operate\": 3, \"high\": 14, \"complexity\": 1, \"routine\": 1, \"use\": 15, \"measures\": 12, \"design\": 12, \"information\": 11, \"cargo\": 10, \"traffic\": 13, \"561\": 1, \"money\": 6, \"spent\": 1, \"strengthening\": 6, \"competitiveness\": 3, \"sphere\": 1, \"sawmill\": 3, \"volume\": 12, \"processing\": 4, \"since\": 10, \"association\": 6, \"data\": 14, \"do\": 3, \"not\": 12, \"cover\": 4, \"figures\": 3, \"100\": 15, \"small\": 5, \"breweries\": 3, \"imported\": 1, \"actual\": 2, \"members\": 9, \"smaller\": 4, \"those\": 4, \"given\": 6, \"diluted\": 14, \"86\": 5, \"impact\": 5, \"meur\": 1, \"improvement\": 12, \"fiscal\": 12, \"done\": 2, \"logistics\": 8, \"largest\": 20, \"diversified\": 1, \"hobby\": 4, \"hall\": 4, \"implementing\": 3, \"system\": 13, \"involved\": 1, \"changing\": 1, \"principal\": 2, \"posting\": 2, \"turun\": 1, \"kaupunkin\": 1, \"based\": 33, \"talotekniikka\": 1, \"installation\": 4, \"work\": 7, \"army\": 1, \"unify\": 1, \"improve\": 13, \"qpr\": 3, \"stated\": 5, \"68\": 7, \"62\": 3, \"week\": 8, \"80\": 10, \"goal\": 4, \"becoming\": 3, \"world\": 17, \"stainless\": 5, \"subscriptions\": 3, \"cargotec\": 15, \"36\": 12, \"780\": 1, \"bas1v\": 1, \"complete\": 4, \"invoice\": 5, \"organization\": 4, \"refining\": 3, \"39\": 10, \"bbl\": 2, \"prior\": 3, \"eur64\": 1, \"realized\": 4, \"during\": 23, \"09\": 5, \"effect\": 1, \"eur10\": 5, \"review\": 4, \"37\": 9, \"'re\": 1, \"delighted\": 5, \"morna\": 1, \"cowie\": 1, \"co\": 5, \"owner\": 3, \"above\": 5, \"double\": 9, \"shop\": 3, \"lovely\": 1, \"feel\": 1, \"kyro\": 1, \"trim\": 1, \"fixed\": 8, \"structures\": 4, \"bridge\": 7, \"spanning\": 1, \"kemijoki\": 1, \"river\": 1, \"northern\": 5, \"kalmar\": 3, \"defense\": 1, \"eur13\": 8, \"decade\": 1, \"gradually\": 1, \"divested\": 1, \"noncore\": 1, \"assets\": 5, \"bought\": 3, \"sports\": 10, \"makers\": 3, \"california\": 1, \"fitness\": 1, \"sparks\": 1, \"nevada\": 1, \"atec\": 1, \"leading\": 23, \"baseball\": 1, \"softball\": 1, \"pitching\": 1, \"machines\": 7, \"currently\": 6, \"foresees\": 2, \"remain\": 9, \"level\": 8, \"when\": 11, \"700\": 5, \"934\": 1, \"projections\": 2, \"better\": 8, \"project\": 22, \"predict\": 1, \"once\": 1, \"skanssi\": 1, \"attract\": 2, \"visitors\": 2, \"annually\": 3, \"retailer\": 6, \"approval\": 5, \"board\": 16, \"rival\": 4, \"lindex\": 3, \"tender\": 1, \"aim\": 12, \"expanding\": 6, \"presence\": 9, \"cee\": 1, \"monday\": 6, \"garden\": 4, \"tools\": 6, \"scissors\": 3, \"goods\": 3, \"shareholding\": 1, \"moment\": 3, \"valio\": 1, \"worried\": 1, \"but\": 6, \"if\": 4, \"ban\": 1, \"continues\": 4, \"problem\": 1, \"2011\": 24, \"communication\": 7, \"tlt1v\": 4, \"rocketed\": 2, \"eur416\": 2, \"lifted\": 3, \"dividend\": 6, \"proposal\": 4, \"import\": 2, \"restrictions\": 1, \"dairy\": 1, \"canceled\": 4, \"personnel\": 18, \"approximately\": 5, \"270\": 3, \"persons\": 3, \"kirkkonummi\": 1, \"nivala\": 1, \"factories\": 1, \"optimization\": 1, \"heating\": 5, \"reduce\": 9, \"consumption\": 6, \"hand\": 5, \"sawmills\": 1, \"strengthens\": 1, \"position\": 13, \"branded\": 3, \"fiskars\": 12, \"president\": 10, \"heikki\": 2, \"allonen\": 1, \"pointing\": 1, \"out\": 13, \"groups\": 2, \"relatively\": 2, \"few\": 3, \"overlapping\": 1, \"counter\": 2, \"action\": 3, \"against\": 7, \"dispute\": 3, \"names\": 1, \"tietoenator\": 4, \"quickly\": 1, \"forest\": 15, \"units\": 12, \"concern\": 2, \"permanent\": 4, \"court\": 6, \"papers\": 4, \"delayed\": 1, \"repairs\": 1, \"elevators\": 8, \"courthouse\": 1, \"21\": 18, \"saltonstall\": 1, \"state\": 5, \"office\": 11, \"issue\": 2, \"thieves\": 1, \"stealing\": 1, \"sites\": 2, \"mr\": 7, \"smith\": 2, \"proud\": 4, \"contribute\": 3, \"creation\": 1, \"class\": 2, \"airport\": 1, \"innovative\": 4, \"tm\": 2, \"firm\": 6, \"lifting\": 4, \"kcr1v\": 2, \"acquired\": 4, \"machine\": 6, \"tool\": 2, \"unlimited\": 1, \"cincinnati\": 1, \"ohio\": 1, \"undisclosed\": 2, \"sum\": 3, \"telecoms\": 3, \"elisa\": 11, \"numbers\": 2, \"cross\": 2, \"400\": 3, \"bns\": 2, \"telecommunications\": 6, \"clients\": 4, \"401\": 2, \"800\": 2, \"884\": 1, \"exceeded\": 2, \"furniture\": 3, \"presently\": 1, \"cuts\": 5, \"transportation\": 5, \"projects\": 10, \"cl51\": 1, \"designed\": 3, \"measure\": 1, \"height\": 2, \"vertical\": 1, \"visibility\": 2, \"weather\": 1, \"conditions\": 5, \"ideal\": 2, \"instrument\": 2, \"meteorological\": 1, \"rely\": 2, \"reliable\": 1, \"detection\": 1, \"acnielsen\": 1, \"scantrack\": 1, \"study\": 1, \"coca\": 3, \"cola\": 3, \"leader\": 4, \"soft\": 1, \"drinks\": 2, \"comparable\": 10, \"short\": 6, \"suominen\": 11, \"ensure\": 6, \"flexible\": 7, \"rtrks\": 5, \"contracted\": 4, \"49\": 8, \"229\": 2, \"ago\": 24, \"myllykoski\": 1, \"germany\": 6, \"revenues\": 9, \"eur286m\": 1, \"eur12m\": 1, \"reuters\": 1, \"eur61m\": 1, \"369\": 1, \"575\": 1, \"669\": 1, \"raise\": 4, \"450\": 2, \"mhz\": 3, \"630\": 1, \"cities\": 2, \"enabling\": 3, \"bi\": 1, \"directional\": 1, \"television\": 1, \"scanfil\": 9, \"communications\": 12, \"give\": 2, \"notice\": 2, \"productional\": 2, \"sievi\": 2, \"56\": 4, \"b\": 4, \"added\": 12, \"38\": 11, \"land\": 6, \"additional\": 6, \"vanhanen\": 1, \"strike\": 6, \"damaging\": 1, \"300\": 6, \"participants\": 2, \"reporters\": 2, \"begin\": 3, \"arrive\": 1, \"russian\": 13, \"vladimir\": 2, \"putin\": 1, \"lahti\": 1, \"kilometers\": 2, \"miles\": 1, \"45\": 13, \"billion\": 30, \"syndicated\": 3, \"clicks\": 1, \"link\": 2, \"contained\": 1, \"mail\": 1, \"he\": 15, \"finds\": 1, \"himself\": 1, \"bogus\": 1, \"site\": 6, \"imitates\": 1, \"his\": 9, \"retrieves\": 1, \"banking\": 2, \"\\u00e2\": 2, \"liquidated\": 1, \"325\": 1, \"loose\": 1, \"partners\": 1, \"mostly\": 2, \"apparent\": 1, \"efficiency\": 14, \"observes\": 1, \"perttu\": 1, \"puro\": 1, \"tradeka\": 1, \"narrows\": 1, \"mo\": 1, \"'09\": 2, \"hardware\": 2, \"elektrobit\": 2, \"ebg1v\": 1, \"eb\": 6, \"eur35\": 1, \"decision\": 7, \"resolve\": 1, \"meego\": 1, \"she\": 2, \"aluminium\": 2, \"book\": 4, \"stood\": 8, \"estimates\": 15, \"centralising\": 1, \"french\": 2, \"bucking\": 1, \"trend\": 6, \"flat\": 1, \"70\": 9, \"slipping\": 1, \"gains\": 2, \"strength\": 5, \"lies\": 1, \"merging\": 1, \"know\": 4, \"how\": 4, \"aldata\": 3, \"g\": 3, \"o\": 4, \"retail\": 10, \"chains\": 2, \"lead\": 12, \"nov\": 7, \"handling\": 18, \"cgcbv\": 3, \"stakes\": 1, \"italian\": 2, \"cvs\": 2, \"technoports\": 1, \"srl\": 3, \"handli\": 1, \"q2\": 4, \"amounted\": 19, \"closely\": 1, \"shipping\": 12, \"agents\": 1, \"greenhouse\": 1, \"emissions\": 1, \"sepp\": 3, \"\\u00e6l\": 2, \"\\u00e6\": 3, \"very\": 12, \"fujitsu\": 2, \"ntt\": 1, \"docomo\": 1, \"advance\": 1, \"progress\": 2, \"lte\": 1, \"juergen\": 1, \"walter\": 1, \"head\": 8, \"converged\": 1, \"core\": 7, \"siemens\": 8, \"networks\": 10, \"138\": 2, \"policy\": 3, \"profitable\": 6, \"lodged\": 1, \"eur25m\": 1, \"primarily\": 2, \"carried\": 9, \"incurred\": 2, \"prolongation\": 1, \"biohit\": 6, \"grow\": 7, \"favourable\": 6, \"trends\": 1, \"return\": 8, \"employed\": 2, \"percentage\": 4, \"previously\": 11, \"concluded\": 5, \"adaptation\": 1, \"adequate\": 1, \"largely\": 1, \"disappointment\": 2, \"just\": 5, \"barrel\": 1, \"amid\": 1, \"volumes\": 8, \"tanker\": 1, \"dec\": 3, \"outotec\": 6, \"ote1v\": 1, \"phosphate\": 2, \"concentrator\": 1, \"siilinjarvi\": 1, \"norwegian\": 8, \"minera\": 1, \"fibers\": 2, \"plastic\": 2, \"continuing\": 9, \"18mn\": 1, \"textile\": 4, \"marimekko\": 10, \"mmo1v\": 3, \"eur8\": 2, \"eur6\": 5, \"listed\": 3, \"yahoo\": 1, \"inc\": 8, \"introduced\": 3, \"malaysians\": 1, \"favorite\": 1, \"content\": 3, \"phones\": 5, \"256\": 5, \"02\": 3, \"turnover\": 15, \"813\": 1, \"191\": 1, \"opus\": 2, \"dc\": 3, \"latest\": 3, \"deal\": 13, \"giant\": 1, \"wipro\": 1, \"transfer\": 4, \"radio\": 4, \"access\": 2, \"related\": 6, \"activities\": 5, \"berlin\": 1, \"hearst\": 1, \"able\": 10, \"consolidate\": 1, \"advertising\": 4, \"does\": 2, \"understand\": 1, \"judge\": 1, \"brazil\": 4, \"associated\": 1, \"pulp\": 13, \"veracel\": 1, \"dutch\": 1, \"noted\": 3, \"consensus\": 5, \"neomarkka\": 1, \"kuitu\": 1, \"interested\": 3, \"buying\": 1, \"restarts\": 1, \"sysopen\": 5, \"digia\": 6, \"ibm\": 1, \"rewarded\": 1, \"distinguished\": 1, \"partner\": 5, \"euro86\": 1, \"110\": 1, \"euro120\": 1, \"outokumpu\": 11, \"bosnia\": 1, \"herzegovina\": 1, \"aluminij\": 1, \"dd\": 1, \"mostar\": 1, \"anode\": 1, \"validating\": 1, \"fgvoip\": 1, \"client\": 2, \"symbian\": 1, \"step\": 3, \"accomplishing\": 1, \"am\": 7, \"materials\": 4, \"e\": 5, \"carbon\": 2, \"disclosure\": 2, \"leadership\": 2, \"cdli\": 2, \"apetit\": 1, \"brand\": 6, \"automatic\": 1, \"varnishing\": 1, \"important\": 3, \"part\": 15, \"central\": 10, \"europe\": 11, \"jozef\": 1, \"misurec\": 1, \"slovakia\": 2, \"underlying\": 4, \"41\": 8, \"i\": 10, \"continuation\": 1, \"outlets\": 2, \"lithuania\": 5, \"190\": 1, \"pharmaceutical\": 3, \"ornav\": 1, \"205\": 2, \"exports\": 3, \"imports\": 1, \"six\": 11, \"liters\": 15, \"88\": 4, \"finnlines\": 5, \"grimaldi\": 2, \"241\": 2, \"384\": 1, \"published\": 2, \"seb\": 2, \"soared\": 1, \"sek6\": 1, \"745\": 1, \"sek1\": 2, \"114\": 1, \"proposed\": 3, \"metso\": 16, \"uncoated\": 1, \"fine\": 1, \"mcc\": 1, \"yinhe\": 1, \"furthermore\": 5, \"bearing\": 3, \"fruit\": 1, \"lang\": 1, \"cramo\": 5, \"rental\": 6, \"latvian\": 3, \"passenger\": 11, \"cars\": 2, \"light\": 3, \"vehicles\": 2, \"country\": 3, \"slight\": 2, \"teliasonera\": 7, \"deliveries\": 4, \"4g\": 2, \"modems\": 1, \"security\": 7, \"privacy\": 2, \"stonesoft\": 2, \"stonegate\": 3, \"carrying\": 2, \"continents\": 1, \"rehu\": 1, \"jouko\": 2, \"lahtinen\": 1, \"stabilise\": 1, \"need\": 3, \"corresponds\": 1, \"man\": 3, \"lifetree\": 1, \"founded\": 1, \"2000\": 2, \"risen\": 2, \"average\": 7, \"margins\": 1, \"late\": 3, \"30s\": 1, \"capacitors\": 1, \"used\": 4, \"reliability\": 2, \"grid\": 2, \"additionally\": 1, \"terminate\": 1, \"maximum\": 2, \"salaried\": 3, \"senior\": 2, \"employment\": 3, \"contracts\": 5, \"firstquarter\": 1, \"of2008\": 1, \"magnus\": 1, \"rosen\": 1, \"tornio\": 2, \"works\": 3, \"employs\": 3, \"whom\": 1, \"scope\": 1, \"tower\": 1, \"chose\": 1, \"add\": 3, \"go\": 1, \"operation\": 8, \"summer\": 5, \"broadsheet\": 1, \"160\": 2, \"tabloid\": 1, \"pages\": 1, \"ability\": 1, \"page\": 1, \"side\": 5, \"sanoma\": 5, \"australian\": 1, \"mirabela\": 2, \"nickel\": 7, \"grinding\": 4, \"sulfide\": 1, \"bahia\": 2, \"poy\": 1, \"tanqia\": 1, \"dibba\": 2, \"fzc\": 1, \"wastewater\": 1, \"emirate\": 1, \"fujairah\": 1, \"uae\": 1, \"116\": 1, \"pipeline\": 1, \"strong\": 18, \"partnership\": 7, \"parties\": 8, \"lankapaja\": 1, \"enter\": 1, \"sheet\": 4, \"buyer\": 2, \"85\": 2, \"raw\": 5, \"material\": 6, \"tiimari\": 8, \"geenrated\": 1, \"quarterly\": 3, \"totalling\": 4, \"4th\": 1, \"surged\": 4, \"eur80m\": 1, \"wins\": 2, \"eur50m\": 2, \"australia\": 3, \"1998\": 1, \"m2\": 1, \"amending\": 1, \"simplifies\": 1, \"plan\": 4, \"increases\": 3, \"incentive\": 2, \"key\": 6, \"stay\": 2, \"08\": 3, \"scheduled\": 3, \"measured\": 4, \"kilometres\": 3, \"rpk\": 2, \"nearly\": 5, \"flights\": 6, \"repeat\": 1, \"follow\": 1, \"successfully\": 2, \"159\": 3, \"delhi\": 1, \"metro\": 2, \"spokeswoman\": 1, \"told\": 8, \"thomson\": 5, \"eur16\": 1, \"eur139m\": 1, \"separately\": 1, \"austrian\": 1, \"austria\": 2, \"czech\": 3, \"republic\": 3, \"hungary\": 4, \"still\": 4, \"experiencing\": 1, \"publication\": 1, \"250\": 1, \"sq\": 4, \"691\": 2, \"ft\": 1, \"copenhagen\": 1, \"premier\": 1, \"district\": 2, \"inaugurated\": 1, \"capitals\": 2, \"consolidated\": 6, \"eur67\": 1, \"eur61\": 2, \"geosentric\": 2, \"gypsii\": 2, \"powered\": 2, \"hotel\": 1, \"reservation\": 1, \"such\": 8, \"popular\": 2, \"beijing\": 3, \"shanghai\": 2, \"lining\": 2, \"stone\": 2, \"books\": 1, \"lassila\": 4, \"tikanoja\": 4, \"imputed\": 1, \"eur11\": 1, \"expected\": 26, \"eur609m\": 1, \"31\": 13, \"mark\": 4, \"133\": 3, \"eur41m\": 1, \"eur30m\": 1, \"then\": 3, \"eur150m\": 1, \"minerals\": 3, \"orders\": 18, \"mineracao\": 1, \"brasil\": 2, \"ltda\": 1, \"cumerio\": 1, \"med\": 1, \"jsco\": 1, \"bulgaria\": 2, \"structure\": 7, \"faster\": 4, \"slid\": 2, \"eur86\": 1, \"eur91\": 1, \"situation\": 11, \"coated\": 2, \"magazine\": 6, \"weak\": 5, \"bss\": 1, \"oss\": 2, \"vas\": 1, \"telecom\": 6, \"tecnotree\": 2, \"worth\": 8, \"specifying\": 1, \"placed\": 1, \"means\": 1, \"duration\": 1, \"nastola\": 1, \"jyvaskyla\": 4, \"southern\": 4, \"wipes\": 5, \"nonwovens\": 5, \"changes\": 7, \"wet\": 5, \"expenditure\": 2, \"unfortunately\": 1, \"fallen\": 1, \"along\": 2, \"decline\": 4, \"negotiation\": 1, \"resulted\": 3, \"reduction\": 6, \"regular\": 1, \"around\": 13, \"covered\": 1, \"pension\": 3, \"arrangements\": 3, \"advise\": 1, \"builders\": 1, \"cogeneration\": 1, \"biggest\": 4, \"kaunas\": 2, \"supervise\": 1, \"addition\": 15, \"ten\": 3, \"block\": 2, \"lamp\": 1, \"harri\": 1, \"koskinen\": 1, \"1996\": 1, \"bestseller\": 1, \"ever\": 2, \"welcome\": 6, \"tapeks\": 1, \"noma\": 1, \"publishing\": 2, \"litas\": 3, \"566\": 2, \"currency\": 5, \"effects\": 2, \"export\": 3, \"lemcon\": 1, \"entire\": 5, \"130\": 4, \"hectare\": 1, \"970\": 1, \"906\": 1, \"connectivity\": 2, \"ilkka\": 5, \"sihvo\": 2, \"comments\": 5, \"conjunction\": 1, \"interim\": 3, \"succeeded\": 2, \"bunge\": 1, \"sign\": 1, \"licensing\": 2, \"sunnuntai\": 1, \"carlshamn\": 1, \"mejeri\": 1, \"brands\": 4, \"stationery\": 3, \"gift\": 3, \"tii1v\": 3, \"driven\": 3, \"baltics\": 2, \"remained\": 4, \"learning\": 2, \"literature\": 1, \"media\": 12, \"162\": 1, \"168\": 1, \"grown\": 3, \"eur598\": 1, \"eur582\": 1, \"oko\": 2, \"raiffeisen\": 1, \"ee\": 1, \"capitalize\": 1, \"similar\": 1, \"368\": 1, \"520\": 2, \"87\": 4, \"2003\": 1, \"triggered\": 1, \"forestry\": 3, \"uncertain\": 1, \"came\": 4, \"electrically\": 1, \"area\": 14, \"container\": 4, \"rubber\": 1, \"tyred\": 1, \"gantry\": 1, \"rtg\": 1, \"saigon\": 1, \"newport\": 1, \"snp\": 1, \"vietnam\": 2, \"25mn\": 1, \"63mn\": 1, \"ky\": 1, \"window\": 2, \"fenestra\": 1, \"forssa\": 2, \"point\": 3, \"logical\": 1, \"weakness\": 2, \"sequenced\": 1, \"card\": 1, \"approach\": 4, \"apparently\": 1, \"already\": 12, \"utilised\": 1, \"circuit\": 4, \"overall\": 5, \"weekly\": 1, \"basis\": 4, \"excess\": 4, \"individual\": 2, \"days\": 2, \"sappi\": 1, \"foreign\": 3, \"graphic\": 1, \"stands\": 2, \"dollars\": 5, \"eur20m\": 1, \"eur94m\": 1, \"eur21m\": 2, \"eur17m\": 1, \"apartment\": 2, \"located\": 5, \"easy\": 1, \"center\": 8, \"school\": 1, \"kindergarten\": 1, \"simdax\": 1, \"available\": 6, \"authorisations\": 1, \"submitted\": 1, \"levels\": 8, \"scandinavia\": 2, \"redundant\": 3, \"grounds\": 1, \"representative\": 7, \"ineta\": 1, \"zaharova\": 1, \"earned\": 2, \"lvl\": 1, \"122\": 2, \"times\": 4, \"eur26\": 1, \"seven\": 4, \"franchising\": 1, \"stores\": 5, \"nike\": 1, \"etteplan\": 2, \"employ\": 1, \"least\": 3, \"borl\": 1, \"\\u00e6nge\": 1, \"threat\": 2, \"blue\": 3, \"white\": 1, \"collar\": 1, \"oulu\": 2, \"terminated\": 1, \"skf\": 3, \"alandsbanken\": 3, \"recommendation\": 5, \"ab\": 9, \"sek150\": 1, \"initiatives\": 1, \"chosen\": 4, \"geographic\": 1, \"ongoing\": 3, \"noting\": 1, \"brno\": 1, \"340\": 1, \"361\": 1, \"200\": 10, \"tons\": 3, \"gasoline\": 1, \"delivery\": 5, \"hamina\": 1, \"terminal\": 3, \"platts\": 1, \"plus\": 3, \"showed\": 5, \"source\": 3, \"stabilised\": 2, \"krippl\": 2, \"produce\": 4, \"mw\": 1, \"91\": 4, \"109mn\": 1, \"lowering\": 2, \"shows\": 2, \"balance\": 4, \"apartments\": 2, \"acquiring\": 4, \"eyes\": 1, \"rebuilds\": 1, \"kveyt\": 1, \"variety\": 1, \"suomalainen\": 1, \"pekoni\": 1, \"marketed\": 1, \"consumers\": 6, \"invested\": 3, \"bring\": 7, \"coverage\": 2, \"nepal\": 1, \"population\": 1, \"circulation\": 2, \"asset\": 2, \"too\": 5, \"markedly\": 1, \"chuck\": 1, \"laid\": 7, \"housing\": 3, \"consultant\": 1, \"job\": 3, \"wife\": 2, \"spending\": 1, \"family\": 2, \"having\": 4, \"alone\": 3, \"eur42m\": 1, \"expenses\": 2, \"pricing\": 2, \"offered\": 4, \"unmanned\": 1, \"stations\": 2, \"accounting\": 6, \"plywood\": 2, \"mills\": 5, \"operated\": 1, \"sveza\": 1, \"opportunity\": 2, \"invoices\": 1, \"receive\": 2, \"electronically\": 1, \"confirmations\": 1, \"upload\": 1, \"catalogues\": 1, \"sep\": 2, \"unnamed\": 4, \"te\": 1, \"via\": 8, \"eur3m\": 3, \"05\": 7, \"64\": 6, \"handle\": 1, \"pay\": 3, \"online\": 3, \"internal\": 1, \"efficient\": 7, \"producers\": 3, \"so\": 6, \"losses\": 5, \"actively\": 1, \"focus\": 10, \"away\": 1, \"towards\": 1, \"dynamic\": 2, \"ervio\": 1, \"20mn\": 1, \"swung\": 8, \"brisk\": 1, \"negative\": 11, \"samsung\": 1, \"occupies\": 1, \"lost\": 4, \"ground\": 3, \"dropping\": 2, \"ford\": 1, \"struggling\": 1, \"face\": 1, \"slowing\": 1, \"truck\": 2, \"suv\": 1, \"surfeit\": 1, \"date\": 2, \"gotta\": 1, \"territories\": 2, \"shedding\": 1, \"73\": 1, \"57\": 7, \"conference\": 1, \"lattelecom\": 1, \"chairman\": 4, \"nils\": 1, \"melngailis\": 1, \"explained\": 3, \"blackstone\": 1, \"kalnapilio\": 1, \"tauro\": 1, \"grupe\": 1, \"kalnapilis\": 1, \"tauras\": 1, \"owned\": 9, \"denmark\": 4, \"royal\": 2, \"unibrew\": 1, \"74\": 5, \"jumped\": 6, \"rich\": 2, \"heritage\": 1, \"developing\": 7, \"experiences\": 1, \"segment\": 4, \"german\": 2, \"home\": 7, \"eli1v\": 1, \"h1\": 2, \"yhtyma\": 3, \"ilk2s\": 2, \"assuming\": 1, \"capman\": 2, \"restaurant\": 1, \"christopher\": 1, \"wynne\": 1, \"papa\": 1, \"john\": 1, \"following\": 3, \"relacom\": 1, \"serving\": 1, \"turkish\": 1, \"doktas\": 1, \"dokumculuk\": 1, \"ticaret\": 1, \"ve\": 1, \"sanayi\": 1, \"92\": 5, \"satisfied\": 2, \"extends\": 2, \"implementation\": 1, \"geographies\": 1, \"maps\": 4, \"map\": 3, \"sek72\": 1, \"983\": 1, \"sek70\": 1, \"283\": 1, \"bullish\": 3, \"indicator\": 1, \"064\": 1, \"printed\": 3, \"pcb\": 2, \"aspocomp\": 7, \"acg1v\": 3, \"385\": 2, \"prepared\": 1, \"answer\": 2, \"calls\": 1, \"detailed\": 1, \"caller\": 1, \"moderate\": 1, \"cvd\": 1, \"risk\": 1, \"purpose\": 1, \"effectiveness\": 1, \"near\": 4, \"considerably\": 5, \"weaker\": 1, \"u\": 5, \"dollar\": 2, \"british\": 3, \"pound\": 2, \"comptel\": 3, \"vendor\": 1, \"selected\": 5, \"orascom\": 1, \"oth\": 1, \"provisioning\": 2, \"activation\": 1, \"eur143\": 1, \"81\": 4, \"fh\": 1, \"license\": 3, \"whereby\": 3, \"patterns\": 2, \"1950s\": 1, \"1960s\": 1, \"1970s\": 1, \"h\": 2, \"afe1v\": 3, \"usd1\": 2, \"social\": 2, \"institution\": 1, \"sodra\": 1, \"seek\": 2, \"ukraine\": 2, \"reiterated\": 1, \"terms\": 8, \"aforementioned\": 1, \"funding\": 2, \"cds\": 1, \"maturity\": 1, \"ranging\": 1, \"ragutis\": 6, \"technoparks\": 1, \"lat1v\": 1, \"t\": 5, \"eur20\": 3, \"eur27\": 1, \"falling\": 2, \"eur22\": 1, \"244\": 1, \"seppala\": 3, \"repurchases\": 1, \"shall\": 1, \"distributable\": 1, \"reserves\": 1, \"diminished\": 1, \"again\": 4, \"repaid\": 1, \"liability\": 1, \"standard\": 4, \"chartered\": 3, \"rest\": 2, \"consideration\": 1, \"partially\": 2, \"repay\": 1, \"liabilities\": 1, \"liquidity\": 2, \"luxembourg\": 1, \"amber\": 1, \"trust\": 1, \"ii\": 1, \"final\": 2, \"council\": 1, \"acquire\": 7, \"sanitas\": 1, \"c\": 2, \"compensation\": 2, \"impacted\": 2, \"consolidation\": 1, \"structural\": 2, \"equity\": 2, \"ratio\": 2, \"54\": 5, \"mechanise\": 1, \"harvesting\": 3, \"eucalyptus\": 1, \"plantations\": 1, \"52\": 4, \"asia\": 10, \"pacific\": 4, \"visa\": 1, \"wave\": 1, \"malaysia\": 2, \"taiwan\": 1, \"korea\": 2, \"expanded\": 2, \"southeast\": 1, \"jung\": 1, \"suspected\": 1, \"adpnews\": 9, \"sek\": 5, \"854m\": 1, \"571\": 1, \"drug\": 1, \"pharmacy\": 1, \"monopoly\": 1, \"apoteket\": 1, \"includes\": 2, \"call\": 1, \"option\": 2, \"maritim\": 1, \"sandanger\": 1, \"dna\": 1, \"function\": 1, \"subcontractor\": 1, \"maingate\": 1, \"responsible\": 2, \"connections\": 2, \"moving\": 1, \"headquarters\": 2, \"signifies\": 1, \"era\": 1, \"activeness\": 1, \"talentum\": 7, \"banks\": 5, \"write\": 1, \"sizable\": 1, \"loans\": 2, \"swedbank\": 2, \"dnb\": 1, \"nor\": 1, \"backdrop\": 1, \"economic\": 3, \"meltdown\": 1, \"stole\": 1, \"burgundy\": 1, \"nissan\": 1, \"altima\": 1, \"takeover\": 4, \"panostaja\": 6, \"expands\": 5, \"specialising\": 2, \"consists\": 1, \"subsidiaries\": 2, \"kopijyva\": 1, \"sokonet\": 1, \"contributed\": 1, \"kari\": 3, \"kauniskangas\": 2, \"truly\": 2, \"takes\": 2, \"heights\": 1, \"adds\": 2, \"jydsk\": 1, \"materiel\": 1, \"udlejning\": 1, \"west\": 4, \"jutland\": 1, \"start\": 11, \"veidekke\": 1, \"entreprenor\": 1, \"wafers\": 3, \"leisure\": 2, \"despite\": 1, \"flew\": 1, \"airline\": 8, \"keep\": 1, \"positions\": 1, \"utilisation\": 1, \"solidium\": 2, \"proper\": 1, \"enhancing\": 1, \"cutlery\": 3, \"fisas\": 3, \"17m\": 1, \"correspond\": 1, \"raisio\": 6, \"raivv\": 1, \"snacks\": 2, \"confectionery\": 1, \"big\": 1, \"bear\": 1, \"95\": 1, \"129\": 1, \"360\": 3, \"old\": 2, \"known\": 4, \"orange\": 1, \"handled\": 1, \"derive\": 1, \"synergies\": 2, \"consolidating\": 1, \"parts\": 1, \"housewares\": 1, \"compete\": 2, \"kraftliner\": 2, \"lee\": 3, \"postel\": 1, \"distributor\": 2, \"standing\": 2, \"sawn\": 1, \"timber\": 1, \"sectors\": 2, \"workers\": 9, \"save\": 4, \"sept\": 1, \"globe\": 1, \"newswire\": 1, \"establishes\": 1, \"connection\": 1, \"jyvaeskylae\": 2, \"silja\": 1, \"attributes\": 1, \"problems\": 1, \"booking\": 1, \"taken\": 3, \"trailer\": 1, \"sky\": 1, \"wind\": 1, \"riga\": 1, \"155\": 1, \"72\": 2, \"kai\": 2, \"telanne\": 1, \"newspapers\": 1, \"achieved\": 2, \"currencies\": 1, \"yekaterinburg\": 1, \"flying\": 1, \"chf\": 1, \"great\": 1, \"necessary\": 3, \"298\": 1, \"full\": 11, \"concept\": 5, \"seoul\": 1, \"tyo\": 2, \"8029\": 1, \"iggesunds\": 1, \"bruk\": 1, \"integrated\": 4, \"paperboard\": 2, \"investigate\": 1, \"meet\": 3, \"tightening\": 1, \"charger\": 1, \"eur177\": 1, \"training\": 1, \"modules\": 2, \"abilities\": 1, \"fulfilling\": 1, \"communal\": 1, \"71\": 4, \"carriage\": 1, \"tallinna\": 1, \"sadam\": 1, \"port\": 8, \"bottom\": 2, \"thanks\": 3, \"charges\": 3, \"instance\": 1, \"belarus\": 1, \"oao\": 1, \"lidskoe\": 2, \"pivo\": 2, \"brewery\": 5, \"grodno\": 1, \"output\": 3, \"045\": 1, \"decaliters\": 1, \"administration\": 4, \"trouble\": 2, \"outside\": 7, \"archipelago\": 1, \"islands\": 2, \"eur21\": 1, \"eur196\": 1, \"adjustment\": 2, \"contrast\": 2, \"less\": 5, \"effective\": 3, \"bore\": 1, \"rettig\": 1, \"recently\": 5, \"thus\": 1, \"reinforce\": 1, \"martela\": 4, \"eur12\": 2, \"dirk\": 1, \"jones\": 1, \"gts\": 2, \"citigroup\": 3, \"citi\": 1, \"custody\": 1, \"salcomp\": 4, \"chargers\": 3, \"83\": 5, \"super\": 1, \"nasty\": 1, \"eric\": 1, \"schultze\": 1, \"shavlik\": 1, \"llc\": 2, \"paul\": 2, \"minn\": 2, \"patch\": 1, \"06\": 4, \"ended\": 5, \"93\": 3, \"item\": 1, \"included\": 4, \"eur394\": 1, \"estonia\": 6, \"progressed\": 1, \"owing\": 1, \"prolonged\": 1, \"winter\": 1, \"season\": 2, \"ahlstrom\": 2, \"specialty\": 3, \"glassfiber\": 1, \"reinforcement\": 1, \"carolina\": 1, \"17mn\": 1, \"mid\": 5, \"rough\": 1, \"terrain\": 1, \"handler\": 1, \"rtch\": 1, \"recycling\": 3, \"introducing\": 1, \"dubna\": 1, \"commencing\": 1, \"pearl\": 2, \"plaza\": 2, \"pm\": 3, \"66\": 3, \"143\": 1, \"67\": 5, \"530\": 1, \"se\": 4, \"field\": 1, \"aggressively\": 1, \"pursuing\": 1, \"increasingly\": 2, \"focusing\": 2, \"technologically\": 2, \"demanding\": 2, \"hdi\": 1, \"boards\": 1, \"pcbs\": 1, \"sharply\": 2, \"surprise\": 1, \"profits\": 4, \"overshadowed\": 1, \"srv\": 3, \"majority\": 3, \"olvi\": 6, \"creates\": 2, \"operational\": 6, \"stable\": 2, \"leads\": 1, \"bo\": 1, \"annvik\": 1, \"executive\": 11, \"jussi\": 3, \"pesonen\": 1, \"fifth\": 2, \"running\": 2, \"competence\": 1, \"references\": 1, \"onodi\": 1, \"stefan\": 1, \"manager\": 4, \"arxikon\": 1, \"figure\": 3, \"245\": 3, \"besides\": 1, \"meat\": 5, \"various\": 2, \"sausages\": 1, \"tastes\": 1, \"grill\": 1, \"shish\": 1, \"kebabs\": 1, \"paavel\": 1, \"eur30\": 1, \"eur38\": 1, \"released\": 3, \"powerless\": 1, \"metrics\": 1, \"scorecard\": 1, \"text\": 1, \"values\": 1, \"theodosopoulos\": 1, \"tellabs\": 1, \"could\": 1, \"nortel\": 1, \"status\": 1, \"verizon\": 1, \"allows\": 3, \"young\": 1, \"child\": 1, \"vessels\": 2, \"got\": 2, \"stuck\": 2, \"narrow\": 1, \"bay\": 2, \"bothnia\": 2, \"ice\": 2, \"thicker\": 1, \"aaland\": 1, \"plumbing\": 3, \"uponor\": 6, \"249\": 2, \"262\": 2, \"rentakran\": 1, \"brings\": 3, \"relationships\": 1, \"authorities\": 2, \"jarmo\": 2, \"laasanen\": 1, \"eur24\": 1, \"bosse\": 2, \"trygvesta\": 1, \"favourably\": 1, \"middle\": 2, \"east\": 4, \"africaand\": 1, \"nok1v\": 1, \"switch\": 2, \"converter\": 2, \"whilst\": 1, \"geosolutions\": 1, \"leverage\": 2, \"gps\": 3, \"search\": 1, \"communities\": 1, \"platform\": 3, \"multimedia\": 1, \"powerful\": 2, \"model\": 2, \"backlog\": 1, \"prospects\": 3, \"gross\": 1, \"healthy\": 2, \"papua\": 1, \"guinea\": 1, \"lihir\": 1, \"gold\": 1, \"asx\": 1, \"lgl\": 1, \"302\": 1, \"ayanambakkam\": 1, \"suburb\": 1, \"chennai\": 1, \"gives\": 4, \"capability\": 4, \"address\": 2, \"segments\": 2, \"corporate\": 7, \"eur33m\": 2, \"eur39m\": 1, \"noon\": 1, \"divisions\": 2, \"adjust\": 2, \"finance\": 2, \"redevelopment\": 1, \"refinancing\": 1, \"maturing\": 1, \"wireless\": 4, \"karputer\": 1, \"twig\": 1, \"satellite\": 1, \"steelmaker\": 1, \"uncertainty\": 1, \"drought\": 1, \"lending\": 4, \"resulting\": 1, \"find\": 3, \"difficult\": 2, \"affectogenimap\": 2, \"intellibis\": 1, \"free\": 1, \"w\": 1, \"\\u00e6rtsil\": 1, \"sound\": 2, \"anjalankoski\": 1, \"jarvenpaa\": 1, \"karhula\": 1, \"valkeakoski\": 1, \"steady\": 1, \"amer\": 3, \"escalators\": 3, \"sir\": 1, \"robert\": 1, \"mcalpine\": 1, \"watermark\": 1, \"323\": 1, \"impairment\": 1, \"far\": 3, \"galvan\": 1, \"avoid\": 1, \"coatings\": 2, \"eur18\": 2, \"eur127\": 1, \"negotiate\": 1, \"definitive\": 1, \"agreements\": 4, \"yokohama\": 1, \"nagoya\": 1, \"silver\": 1, \"spring\": 3, \"metropolitan\": 1, \"washington\": 1, \"usa\": 2, \"graz\": 1, \"aalborg\": 1, \"eur121m\": 1, \"eur97m\": 1, \"sal1v\": 2, \"adapter\": 1, \"certified\": 2, \"integration\": 4, \"sap\": 1, \"\\u008b\": 2, \"netweaver\": 1, \"endorsement\": 1, \"integrates\": 1, \"procurement\": 3, \"different\": 3, \"erp\": 1, \"budapest\": 1, \"mti\": 2, \"pecs\": 1, \"zoltan\": 1, \"foundries\": 2, \"reductions\": 5, \"subdivision\": 1, \"480\": 1, \"414\": 1, \"thereby\": 2, \"flag\": 1, \"fia1s\": 2, \"sealed\": 2, \"leaseback\": 1, \"newest\": 1, \"airbus\": 2, \"a330\": 1, \"aircraft\": 2, \"syndication\": 1, \"lease\": 2, \"swiss\": 2, \"franc\": 1, \"sharpest\": 1, \"directors\": 4, \"garry\": 1, \"mcguire\": 1, \"rmg\": 1, \"299\": 3, \"novator\": 2, \"entered\": 4, \"securities\": 1, \"directly\": 1, \"amount\": 4, \"forwards\": 1, \"celebrates\": 1, \"fiftieth\": 1, \"anniversary\": 1, \"exporting\": 1, \"distinctive\": 1, \"detached\": 1, \"homes\": 1, \"decades\": 1, \"070\": 1, \"tinyurl\": 1, \"scamming\": 1, \"promising\": 3, \"earn\": 1, \"thousands\": 1, \"google\": 2, \"goog\": 1, \"advertiser\": 1, \"promotion\": 1, \"generated\": 2, \"lowered\": 3, \"232\": 1, \"69\": 1, \"meanwhile\": 4, \"lemmink\": 2, \"\\u00e6inen\": 2, \"road\": 3, \"transport\": 3, \"145\": 2, \"sverige\": 2, \"balanced\": 1, \"broad\": 1, \"portfolio\": 7, \"happy\": 6, \"encourage\": 1, \"boaters\": 1, \"anglers\": 1, \"introduce\": 1, \"newcomers\": 1, \"sport\": 2, \"rbff\": 1, \"frank\": 1, \"peterson\": 1, \"doubled\": 4, \"197mn\": 1, \"bln\": 5, \"amounting\": 1, \"365\": 1, \"534\": 2, \"94\": 3, \"211\": 1, \"beating\": 1, \"235\": 1, \"bts\": 1, \"configured\": 1, \"diagnosed\": 1, \"remotely\": 1, \"bad\": 1, \"barbeque\": 1, \"frequency\": 2, \"york\": 1, \"explains\": 1, \"pharma\": 1, \"repeats\": 1, \"sees\": 2, \"y\": 2, \"newsroom\": 1, \"keywords\": 1, \"customised\": 2, \"genesis\": 1, \"ship\": 2, \"179mn\": 1, \"188mn\": 1, \"indo\": 1, \"targeted\": 1, \"2015\": 1, \"irritants\": 1, \"procedural\": 1, \"hassles\": 1, \"resolved\": 1, \"chamber\": 1, \"survey\": 1, \"obstacles\": 1, \"oversupply\": 1, \"pharmacies\": 1, \"518\": 1, \"cap\": 2, \"711\": 1, \"brazilian\": 5, \"interbank\": 1, \"camara\": 1, \"interbancaria\": 1, \"de\": 1, \"pagamentos\": 1, \"cip\": 1, \"sterling\": 1, \"commerce\": 1, \"latter\": 2, \"statement\": 4, \"dmasia\": 1, \"asmobile\": 1, \"digitalmediaasia\": 1, \"com\": 2, \"dma\": 1, \"satlan\": 1, \"video\": 3, \"broadcasters\": 1, \"iptv\": 1, \"providers\": 2, \"honkamaa\": 1, \"looks\": 2, \"viewpoint\": 1, \"turn\": 5, \"should\": 3, \"what\": 2, \"twofold\": 1, \"zahariev\": 1, \"'10\": 1, \"ponsse\": 7, \"pon1v\": 1, \"eur9\": 1, \"pioneer\": 2, \"devices\": 4, \"propose\": 3, \"granting\": 1, \"licence\": 2, \"reactors\": 1, \"built\": 3, \"fennovoima\": 1, \"tvo\": 1, \"babcock\": 1, \"harvester\": 2, \"heads\": 2, \"stan\": 1, \"ftse\": 3, \"scotland\": 1, \"rbs\": 1, \"barclays\": 1, \"barc\": 1, \"bcs\": 1, \"adjusted\": 2, \"antti\": 1, \"orkola\": 1, \"growhow\": 2, \"put\": 1, \"mine\": 5, \"depressed\": 1, \"eur28\": 1, \"warmly\": 2, \"michael\": 1, \"frei\": 1, \"synergy\": 2, \"benefits\": 2, \"materialise\": 1, \"alma\": 3, \"traces\": 1, \"toxic\": 1, \"osmium\": 1, \"tetroxide\": 1, \"found\": 4, \"coast\": 2, \"\\u00e6meri\": 1, \"northernmost\": 1, \"gulf\": 1, \"salonen\": 1, \"inventories\": 1, \"declining\": 1, \"linkspans\": 1, \"morocco\": 1, \"ireland\": 1, \"eur928\": 2, \"install\": 5, \"kyronsalmi\": 2, \"strait\": 2, \"savonlinna\": 2, \"bg\": 1, \"ad\": 1, \"ebitda\": 5, \"eur116m\": 1, \"eur115m\": 1, \"5mn\": 1, \"wider\": 1, \"options\": 1, \"uh\": 1, \"extensively\": 2, \"later\": 1, \"functionalities\": 1, \"human\": 1, \"resources\": 7, \"3mn\": 2, \"selling\": 3, \"eur647m\": 1, \"sakari\": 1, \"tamminen\": 1, \"american\": 2, \"depositary\": 1, \"northland\": 2, \"kaunisvaara\": 1, \"iron\": 2, \"ore\": 2, \"tapuli\": 1, \"sahavaara\": 1, \"deposits\": 1, \"renzo\": 1, \"piano\": 1, \"wonderful\": 1, \"skyline\": 1, \"noud\": 1, \"veeger\": 1, \"evp\": 1, \"tim\": 2, \"cockroft\": 1, \"him\": 3, \"excellent\": 1, \"moreover\": 1, \"singer\": 1, \"friedlander\": 1, \"involving\": 1, \"broking\": 1, 